Revit 2027 API
FaceDetailNode Class
 A base class of output nodes that represent face edges and face silhouettes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceEdgeNode
 Autodesk.Revit.DB.FaceSilhouetteNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceDetailNode : RenderNode
Public Class FaceDetailNode
	Inherits RenderNode
public ref class FaceDetailNode : public RenderNode
type FaceDetailNode =
    class
        inherit RenderNode
    end
The FaceDetailNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
LineProperties |  Access to the line (pen) properties of the curve being drawn.
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetInstanceTransform |  Returns instance transform of the object being drawn.
GetLinkTransform |  Returns link transform of the object being drawn.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace